<!-- attach-outputs:plan-nodes-test.txt -->
  <!-- Output: plan-nodes-test.txt -->
  #### plan-nodes-test.txt 📖: `test: success, prod: success`

  **Last updated:** Jan 7, 2026, 02:40 AM UTC

  <details><summary>Show Contents</summary>

  ```

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # proxmox_virtual_environment_download_file.talos_iso["nuc-g2p-1"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "talos_iso" {
      ~ file_name           = "talos-x-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply) # forces replacement
      ~ id                  = "local:iso/talos-x-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply)
      ~ size                = 315961344 -> (known after apply)
      ~ url                 = "https://factory.talos.dev/image/10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67/v1.12.0/nocloud-amd64.iso" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # proxmox_virtual_environment_download_file.talos_iso["nuc-g2p-2"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "talos_iso" {
      ~ file_name           = "talos-x-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply) # forces replacement
      ~ id                  = "local:iso/talos-x-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply)
      ~ size                = 315961344 -> (known after apply)
      ~ url                 = "https://factory.talos.dev/image/10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67/v1.12.0/nocloud-amd64.iso" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # proxmox_virtual_environment_download_file.talos_iso["nuc-g3p-1"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "talos_iso" {
      ~ file_name           = "talos-x-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply) # forces replacement
      ~ id                  = "local:iso/talos-x-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply)
      ~ size                = 315961344 -> (known after apply)
      ~ url                 = "https://factory.talos.dev/image/10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67/v1.12.0/nocloud-amd64.iso" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # proxmox_virtual_environment_download_file.talos_iso["nuc-g3p-2"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "talos_iso" {
      ~ file_name           = "talos-x-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply) # forces replacement
      ~ id                  = "local:iso/talos-x-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply)
      ~ size                = 315961344 -> (known after apply)
      ~ url                 = "https://factory.talos.dev/image/10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67/v1.12.0/nocloud-amd64.iso" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # talos_image_factory_schematic.metal_amd will be updated in-place
  ~ resource "talos_image_factory_schematic" "metal_amd" {
      ~ id        = "a53e50ce56fa0b0ca1f96d993265508b0608050f6df4b7f4197ef510655d637a" -> (known after apply)
      ~ schematic = <<-EOT
            "customization":
              "extraKernelArgs":
          +   - "net.ifnames=0"
              - "-talos.halt_if_installed"
              "systemExtensions":
                "officialExtensions":
                - "siderolabs/amdgpu"
                - "siderolabs/amd-ucode"
        EOT
    }

  # talos_image_factory_schematic.vm will be updated in-place
  ~ resource "talos_image_factory_schematic" "vm" {
      ~ id        = "10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67" -> (known after apply)
      ~ schematic = <<-EOT
            "customization":
              "extraKernelArgs":
              - "vga=792"
          +   - "net.ifnames=0"
              - "-talos.halt_if_installed"
              "systemExtensions":
                "officialExtensions":
                - "siderolabs/qemu-guest-agent"
        EOT
    }

  # module.cluster.onepassword_item.misc_config will be updated in-place
  ~ resource "onepassword_item" "misc_config" {
        id       = "vaults/lyyqeg3pe6dvqdeb5hbiu7b76y/items/o76maeryvppa2seizd3ulbq24y"
      + password = (sensitive value)
        # (4 unchanged attributes hidden)

      ~ section {
            id    = "fa9c3feb-2df9-1590-b281-be4ee86dda2a"
            # (1 unchanged attribute hidden)

          ~ field {
                id    = "627a2ac3-bfe9-b3d3-33b5-6d58f634812a"
              ~ value = (sensitive value)
                # (2 unchanged attributes hidden)
            }

            # (13 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.cluster.module.talos-vm["tiles-test-cp"].proxmox_virtual_environment_vm.main will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7411"
        name                                 = "tiles-test-cp"
        tags                                 = []
        # (34 unchanged attributes hidden)

      ~ cdrom {
          ~ file_id   = "local:iso/talos-x-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-test-cp"].talos_machine_configuration_apply.this will be replaced due to changes in replace_triggered_by
-/+ resource "talos_machine_configuration_apply" "this" {
      ~ config_patches              = [
          ~ <<-EOT
                version: v1alpha1
                cluster:
                  network:
                    # cilium will become our CNI.
                    cni:
                      name: none
                  controllerManager:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  scheduler:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  apiServer:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  proxy:
                    # Cilium will replace the proxy
                    disabled: true
                machine:
                  sysctls:
                    user.max_user_namespaces: "8192"
                  # https://www.talos.dev/v1.10/talos-guides/configuration/containerd/#exposing-metrics
                  files:
                    - content: |
                        [metrics]
                          address = "0.0.0.0:11234"
                      path: /etc/cri/conf.d/20-customization.part
                      op: create
                  features:
                    rbac: true
                    diskQuotaSupport: true
                    hostDNS:
                      enabled: true
                      resolveMemberNames: true
                      forwardKubeDNSToHost: false
                    imageCache:
                      localEnabled: true
                  install:
                    # wipe: true
              -     extraKernelArgs:
              -       # 1024x768 for the dashboard:
              -       - vga=792
              -       # Disable predictable network interface names (use eth0, eth1, etc.)
              -       - net.ifnames=0
              -       - -talos.halt_if_installed
              +     # extraKernelArgs are set in the schematic customization, not here
              +     # Setting them here conflicts with grubUseUKICmdline when using schematics
            EOT,
            <<-EOT
                "cluster":
                  "clusterName": "tiles-test"
                  "network":
                    "podSubnets":
                    - "10.0.208.0/20"
                    "serviceSubnets":
                    - "10.0.200.0/21"
                "version": "v1alpha1"
            EOT,
          ~ <<-EOT
                "machine":
                  "install":
                    "image": "factory.talos.dev/installer/10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67:v1.12.0"
            EOT -> (known after apply),
            <<-EOT
                "apiVersion": "v1alpha1"
                "kind": "Layer2VIPConfig"
                "link": "eth0"
                "name": "10.0.192.10"
            EOT,
        ]
      ~ id                          = "machine_configuration_apply" -> (known after apply)
      ~ machine_configuration       = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.cluster.module.talos-vm["tiles-test-wk"].proxmox_virtual_environment_vm.main will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7421"
        name                                 = "tiles-test-wk"
        tags                                 = []
        # (34 unchanged attributes hidden)

      ~ cdrom {
          ~ file_id   = "local:iso/talos-x-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-test-wk"].talos_machine_configuration_apply.this will be replaced due to changes in replace_triggered_by
-/+ resource "talos_machine_configuration_apply" "this" {
      ~ config_patches              = [
          ~ <<-EOT
                version: v1alpha1
                cluster:
                  network:
                    # cilium will become our CNI.
                    cni:
                      name: none
                  controllerManager:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  scheduler:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  apiServer:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  proxy:
                    # Cilium will replace the proxy
                    disabled: true
                machine:
                  sysctls:
                    user.max_user_namespaces: "8192"
                  # https://www.talos.dev/v1.10/talos-guides/configuration/containerd/#exposing-metrics
                  files:
                    - content: |
                        [metrics]
                          address = "0.0.0.0:11234"
                      path: /etc/cri/conf.d/20-customization.part
                      op: create
                  features:
                    rbac: true
                    diskQuotaSupport: true
                    hostDNS:
                      enabled: true
                      resolveMemberNames: true
                      forwardKubeDNSToHost: false
                    imageCache:
                      localEnabled: true
                  install:
                    # wipe: true
              -     extraKernelArgs:
              -       # 1024x768 for the dashboard:
              -       - vga=792
              -       # Disable predictable network interface names (use eth0, eth1, etc.)
              -       - net.ifnames=0
              -       - -talos.halt_if_installed
              +     # extraKernelArgs are set in the schematic customization, not here
              +     # Setting them here conflicts with grubUseUKICmdline when using schematics
            EOT,
            <<-EOT
                "cluster":
                  "clusterName": "tiles-test"
                  "network":
                    "podSubnets":
                    - "10.0.208.0/20"
                    "serviceSubnets":
                    - "10.0.200.0/21"
                "version": "v1alpha1"
            EOT,
          ~ <<-EOT
                "machine":
                  "install":
                    "image": "factory.talos.dev/installer/10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67:v1.12.0"
            EOT -> (known after apply),
        ]
      ~ id                          = "machine_configuration_apply" -> (known after apply)
      ~ machine_configuration       = (sensitive value)
        # (5 unchanged attributes hidden)
    }

Plan: 6 to add, 5 to change, 6 to destroy.

Changes to Outputs:
  ~ metal_amd_iso_url      = "https://factory.talos.dev/image/a53e50ce56fa0b0ca1f96d993265508b0608050f6df4b7f4197ef510655d637a/v1.12.0/metal-amd64.iso" -> (known after apply)
  ~ metal_amd_schematic_id = "a53e50ce56fa0b0ca1f96d993265508b0608050f6df4b7f4197ef510655d637a" -> (known after apply)
  ~ vm_schematic_id        = "10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67" -> (known after apply)

  ```

  </details>
  
  